Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.1.122/edc/PIC32CX1025SG41128.PIC
      <edc:AdjustPoint edc:offset="0x6" edc:_addr="0x4000000A"/>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTFLAGAHB" edc:nzwidth="0x20" edc:access="-----------------nnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFF" edc:_addr="0x40000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="FLASH_" edc:nzwidth="0x1" edc:desc="FLASH"/>
            <edc:SFRFieldDef edc:cname="FLASH_ALT_" edc:nzwidth="0x1" edc:desc="FLASH_ALT"/>
            <edc:SFRFieldDef edc:cname="SEEPROM_" edc:nzwidth="0x1" edc:desc="SEEPROM"/>
            <edc:SFRFieldDef edc:cname="RAMCM4S_" edc:nzwidth="0x1" edc:desc="RAMCM4S"/>
            <edc:SFRFieldDef edc:cname="RAMPPPDSU_" edc:nzwidth="0x1" edc:desc="RAMPPPDSU"/>
            <edc:SFRFieldDef edc:cname="RAMDMAWR_" edc:nzwidth="0x1" edc:desc="RAMDMAWR"/>
            <edc:SFRFieldDef edc:cname="RAMDMACICM_" edc:nzwidth="0x1" edc:desc="RAMDMACICM"/>
            <edc:SFRFieldDef edc:cname="HPB0_" edc:nzwidth="0x1" edc:desc="HPB0"/>
            <edc:SFRFieldDef edc:cname="HPB1_" edc:nzwidth="0x1" edc:desc="HPB1"/>
            <edc:SFRFieldDef edc:cname="HPB2_" edc:nzwidth="0x1" edc:desc="HPB2"/>
            <edc:SFRFieldDef edc:cname="HPB3_" edc:nzwidth="0x1" edc:desc="HPB3"/>
            <edc:SFRFieldDef edc:cname="PUKCC_" edc:nzwidth="0x1" edc:desc="PUKCC"/>
            <edc:SFRFieldDef edc:cname="SDHC0_" edc:nzwidth="0x1" edc:desc="SDHC0"/>
            <edc:SFRFieldDef edc:cname="SDHC1_" edc:nzwidth="0x1" edc:desc="SDHC1"/>
            <edc:SFRFieldDef edc:cname="QSPI_" edc:nzwidth="0x1" edc:desc="QSPI"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTFLAGA" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x40000014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:nzwidth="0x1" edc:desc="PAC"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:nzwidth="0x1" edc:desc="PM"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:nzwidth="0x1" edc:desc="MCLK"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:nzwidth="0x1" edc:desc="RSTC"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:nzwidth="0x1" edc:desc="OSCCTRL"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:nzwidth="0x1" edc:desc="OSC32KCTRL"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:nzwidth="0x1" edc:desc="SUPC"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:nzwidth="0x1" edc:desc="GCLK"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:nzwidth="0x1" edc:desc="WDT"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:nzwidth="0x1" edc:desc="RTC"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:nzwidth="0x1" edc:desc="EIC"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:nzwidth="0x1" edc:desc="FREQM"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:nzwidth="0x1" edc:desc="SERCOM0"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:nzwidth="0x1" edc:desc="SERCOM1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:nzwidth="0x1" edc:desc="TC0"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:nzwidth="0x1" edc:desc="TC1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTFLAGB" edc:nzwidth="0x20" edc:access="---------------n-nnnnnn-n-nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x17EBF" edc:_addr="0x40000018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="USB_" edc:nzwidth="0x1" edc:desc="USB"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:nzwidth="0x1" edc:desc="DSU"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:nzwidth="0x1" edc:desc="NVMCTRL"/>
            <edc:SFRFieldDef edc:cname="CMCC_" edc:nzwidth="0x1" edc:desc="CMCC"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:nzwidth="0x1" edc:desc="PORT"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:nzwidth="0x1" edc:desc="DMAC"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:nzwidth="0x1" edc:desc="EVSYS"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:nzwidth="0x1" edc:desc="SERCOM2"/>
            <edc:SFRFieldDef edc:cname="SERCOM3_" edc:nzwidth="0x1" edc:desc="SERCOM3"/>
            <edc:SFRFieldDef edc:cname="TCC0_" edc:nzwidth="0x1" edc:desc="TCC0"/>
            <edc:SFRFieldDef edc:cname="TCC1_" edc:nzwidth="0x1" edc:desc="TCC1"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:nzwidth="0x1" edc:desc="TC2"/>
            <edc:SFRFieldDef edc:cname="TC3_" edc:nzwidth="0x1" edc:desc="TC3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RAMECC_" edc:nzwidth="0x1" edc:desc="RAMECC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTFLAGC" edc:nzwidth="0x20" edc:access="-----------------nnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFF" edc:_addr="0x4000001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="CAN0_" edc:nzwidth="0x1" edc:desc="CAN0"/>
            <edc:SFRFieldDef edc:cname="CAN1_" edc:nzwidth="0x1" edc:desc="CAN1"/>
            <edc:SFRFieldDef edc:cname="GMAC_" edc:nzwidth="0x1" edc:desc="GMAC"/>
            <edc:SFRFieldDef edc:cname="TCC2_" edc:nzwidth="0x1" edc:desc="TCC2"/>
            <edc:SFRFieldDef edc:cname="TCC3_" edc:nzwidth="0x1" edc:desc="TCC3"/>
            <edc:SFRFieldDef edc:cname="TC4_" edc:nzwidth="0x1" edc:desc="TC4"/>
            <edc:SFRFieldDef edc:cname="TC5_" edc:nzwidth="0x1" edc:desc="TC5"/>
            <edc:SFRFieldDef edc:cname="PDEC_" edc:nzwidth="0x1" edc:desc="PDEC"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:nzwidth="0x1" edc:desc="AC"/>
            <edc:SFRFieldDef edc:cname="AES_" edc:nzwidth="0x1" edc:desc="AES"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:nzwidth="0x1" edc:desc="TRNG"/>
            <edc:SFRFieldDef edc:cname="ICM_" edc:nzwidth="0x1" edc:desc="ICM"/>
            <edc:SFRFieldDef edc:cname="PUKCC_" edc:nzwidth="0x1" edc:desc="PUKCC"/>
            <edc:SFRFieldDef edc:cname="QSPI_" edc:nzwidth="0x1" edc:desc="QSPI"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:nzwidth="0x1" edc:desc="CCL"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTFLAGD" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF" edc:_addr="0x40000020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="SERCOM4_" edc:nzwidth="0x1" edc:desc="SERCOM4"/>
            <edc:SFRFieldDef edc:cname="SERCOM5_" edc:nzwidth="0x1" edc:desc="SERCOM5"/>
            <edc:SFRFieldDef edc:cname="SERCOM6_" edc:nzwidth="0x1" edc:desc="SERCOM6"/>
            <edc:SFRFieldDef edc:cname="SERCOM7_" edc:nzwidth="0x1" edc:desc="SERCOM7"/>
            <edc:SFRFieldDef edc:cname="TCC4_" edc:nzwidth="0x1" edc:desc="TCC4"/>
            <edc:SFRFieldDef edc:cname="TC6_" edc:nzwidth="0x1" edc:desc="TC6"/>
            <edc:SFRFieldDef edc:cname="TC7_" edc:nzwidth="0x1" edc:desc="TC7"/>
            <edc:SFRFieldDef edc:cname="ADC0_" edc:nzwidth="0x1" edc:desc="ADC0"/>
            <edc:SFRFieldDef edc:cname="ADC1_" edc:nzwidth="0x1" edc:desc="ADC1"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:nzwidth="0x1" edc:desc="DAC"/>
            <edc:SFRFieldDef edc:cname="I2S_" edc:nzwidth="0x1" edc:desc="I2S"/>
            <edc:SFRFieldDef edc:cname="PCC_" edc:nzwidth="0x1" edc:desc="PCC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x40000024"/>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="STATUSA" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:por="00000000000000010000000000000000" edc:mclr="00000000000000010000000000000000" edc:impl="0xFFFF" edc:_addr="0x40000034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:nzwidth="0x1" edc:desc="PAC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:nzwidth="0x1" edc:desc="PM APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:nzwidth="0x1" edc:desc="MCLK APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:nzwidth="0x1" edc:desc="RSTC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:nzwidth="0x1" edc:desc="OSCCTRL APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:nzwidth="0x1" edc:desc="OSC32KCTRL APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:nzwidth="0x1" edc:desc="SUPC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:nzwidth="0x1" edc:desc="GCLK APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:nzwidth="0x1" edc:desc="WDT APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:nzwidth="0x1" edc:desc="RTC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:nzwidth="0x1" edc:desc="EIC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:nzwidth="0x1" edc:desc="FREQM APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:nzwidth="0x1" edc:desc="SERCOM0 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:nzwidth="0x1" edc:desc="SERCOM1 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:nzwidth="0x1" edc:desc="TC0 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:nzwidth="0x1" edc:desc="TC1 APB Protect Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="STATUSB" edc:nzwidth="0x20" edc:access="---------------r-rrrrrr-r-rrrrrr" edc:por="00000000000000000000000000000010" edc:mclr="00000000000000000000000000000010" edc:impl="0x17EBF" edc:_addr="0x40000038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="USB_" edc:nzwidth="0x1" edc:desc="USB APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:nzwidth="0x1" edc:desc="DSU APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:nzwidth="0x1" edc:desc="NVMCTRL APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="CMCC_" edc:nzwidth="0x1" edc:desc="CMCC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:nzwidth="0x1" edc:desc="PORT APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:nzwidth="0x1" edc:desc="DMAC APB Protect Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:nzwidth="0x1" edc:desc="EVSYS APB Protect Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:nzwidth="0x1" edc:desc="SERCOM2 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM3_" edc:nzwidth="0x1" edc:desc="SERCOM3 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TCC0_" edc:nzwidth="0x1" edc:desc="TCC0 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TCC1_" edc:nzwidth="0x1" edc:desc="TCC1 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:nzwidth="0x1" edc:desc="TC2 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TC3_" edc:nzwidth="0x1" edc:desc="TC3 APB Protect Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RAMECC_" edc:nzwidth="0x1" edc:desc="RAMECC APB Protect Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="STATUSC" edc:nzwidth="0x20" edc:access="-----------------rrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFF" edc:_addr="0x4000003C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="CAN0_" edc:nzwidth="0x1" edc:desc="CAN0 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="CAN1_" edc:nzwidth="0x1" edc:desc="CAN1 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="GMAC_" edc:nzwidth="0x1" edc:desc="GMAC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TCC2_" edc:nzwidth="0x1" edc:desc="TCC2 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TCC3_" edc:nzwidth="0x1" edc:desc="TCC3 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TC4_" edc:nzwidth="0x1" edc:desc="TC4 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TC5_" edc:nzwidth="0x1" edc:desc="TC5 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="PDEC_" edc:nzwidth="0x1" edc:desc="PDEC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:nzwidth="0x1" edc:desc="AC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="AES_" edc:nzwidth="0x1" edc:desc="AES APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:nzwidth="0x1" edc:desc="TRNG APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="ICM_" edc:nzwidth="0x1" edc:desc="ICM APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="PUKCC_" edc:nzwidth="0x1" edc:desc="PUKCC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="QSPI_" edc:nzwidth="0x1" edc:desc="QSPI APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:nzwidth="0x1" edc:desc="CCL APB Protect Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
