Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.1.122/edc/PIC32CX1025SG41128.PIC
      <edc:SFRDef ltx:memberofperipheral="TCC1" edc:cname="INTFLAG" edc:nzwidth="0x20" edc:access="----------nnnnnnnnnnnn------nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFC0F" edc:_addr="0x4101802C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="Overflow"/>
            <edc:SFRFieldDef edc:cname="TRG" edc:nzwidth="0x1" edc:desc="Retrigger"/>
            <edc:SFRFieldDef edc:cname="CNT" edc:nzwidth="0x1" edc:desc="Counter"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Error"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="UFS" edc:nzwidth="0x1" edc:desc="Non-Recoverable Update Fault"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:nzwidth="0x1" edc:desc="Non-Recoverable Debug Fault"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:nzwidth="0x1" edc:desc="Recoverable Fault A"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:nzwidth="0x1" edc:desc="Recoverable Fault B"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault 0"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault 1"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:nzwidth="0x1" edc:desc="Match or Capture 0"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:nzwidth="0x1" edc:desc="Match or Capture 1"/>
            <edc:SFRFieldDef edc:cname="MC2" edc:nzwidth="0x1" edc:desc="Match or Capture 2"/>
            <edc:SFRFieldDef edc:cname="MC3" edc:nzwidth="0x1" edc:desc="Match or Capture 3"/>
            <edc:SFRFieldDef edc:cname="MC4" edc:nzwidth="0x1" edc:desc="Match or Capture 4"/>
            <edc:SFRFieldDef edc:cname="MC5" edc:nzwidth="0x1" edc:desc="Match or Capture 5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC1" edc:cname="STATUS" edc:nzwidth="0x20" edc:access="--nnnnnn--nnnnnnnnnnnnnnn-nnnnnn" edc:por="00000000000000000000000000000001" edc:mclr="00000000000000000000000000000001" edc:impl="0x3F3FFFBF" edc:_addr="0x41018030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="STOP" edc:nzwidth="0x1" edc:desc="Stop"/>
            <edc:SFRFieldDef edc:cname="IDX" edc:nzwidth="0x1" edc:desc="Ramp"/>
            <edc:SFRFieldDef edc:cname="UFS" edc:nzwidth="0x1" edc:desc="Non-recoverable Update Fault State"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:nzwidth="0x1" edc:desc="Non-Recoverable Debug Fault State"/>
            <edc:SFRFieldDef edc:cname="SLAVE" edc:nzwidth="0x1" edc:desc="Slave"/>
            <edc:SFRFieldDef edc:cname="PATTBUFV" edc:nzwidth="0x1" edc:desc="Pattern Buffer Valid"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PERBUFV" edc:nzwidth="0x1" edc:desc="Period Buffer Valid"/>
            <edc:SFRFieldDef edc:cname="FAULTAIN" edc:nzwidth="0x1" edc:desc="Recoverable Fault A Input"/>
            <edc:SFRFieldDef edc:cname="FAULTBIN" edc:nzwidth="0x1" edc:desc="Recoverable Fault B Input"/>
            <edc:SFRFieldDef edc:cname="FAULT0IN" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault0 Input"/>
            <edc:SFRFieldDef edc:cname="FAULT1IN" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault1 Input"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:nzwidth="0x1" edc:desc="Recoverable Fault A State"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:nzwidth="0x1" edc:desc="Recoverable Fault B State"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault 0 State"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault 1 State"/>
            <edc:SFRFieldDef edc:cname="CCBUFV0" edc:nzwidth="0x1" edc:desc="Compare Channel 0 Buffer Valid"/>
            <edc:SFRFieldDef edc:cname="CCBUFV1" edc:nzwidth="0x1" edc:desc="Compare Channel 1 Buffer Valid"/>
            <edc:SFRFieldDef edc:cname="CCBUFV2" edc:nzwidth="0x1" edc:desc="Compare Channel 2 Buffer Valid"/>
            <edc:SFRFieldDef edc:cname="CCBUFV3" edc:nzwidth="0x1" edc:desc="Compare Channel 3 Buffer Valid"/>
            <edc:SFRFieldDef edc:cname="CCBUFV4" edc:nzwidth="0x1" edc:desc="Compare Channel 4 Buffer Valid"/>
            <edc:SFRFieldDef edc:cname="CCBUFV5" edc:nzwidth="0x1" edc:desc="Compare Channel 5 Buffer Valid"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP0" edc:nzwidth="0x1" edc:desc="Compare Channel 0 Value"/>
            <edc:SFRFieldDef edc:cname="CMP1" edc:nzwidth="0x1" edc:desc="Compare Channel 1 Value"/>
            <edc:SFRFieldDef edc:cname="CMP2" edc:nzwidth="0x1" edc:desc="Compare Channel 2 Value"/>
            <edc:SFRFieldDef edc:cname="CMP3" edc:nzwidth="0x1" edc:desc="Compare Channel 3 Value"/>
            <edc:SFRFieldDef edc:cname="CMP4" edc:nzwidth="0x1" edc:desc="Compare Channel 4 Value"/>
            <edc:SFRFieldDef edc:cname="CMP5" edc:nzwidth="0x1" edc:desc="Compare Channel 5 Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC1" edc:cname="COUNT" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x41018034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x18" edc:desc="Counter Value"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x14" edc:desc="Counter Value"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x13" edc:desc="Counter Value"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x12" edc:desc="Counter Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
