Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.1.122/edc/PIC32CX1025SG41128.PIC
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="TBFR255" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42000970">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="NFRX" edc:nzwidth="0x20" edc:desc="128 to 255 Byte Frames Received without Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="TBFR511" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42000974">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="NFRX" edc:nzwidth="0x20" edc:desc="256 to 511 Byte Frames Received without Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="TBFR1023" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42000978">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="NFRX" edc:nzwidth="0x20" edc:desc="512 to 1023 Byte Frames Received without Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="TBFR1518" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4200097C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="NFRX" edc:nzwidth="0x20" edc:desc="1024 to 1518 Byte Frames Received without Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="TMXBFR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42000980">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="NFRX" edc:nzwidth="0x20" edc:desc="1519 to Maximum Byte Frames Received without Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="UFR" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF" edc:_addr="0x42000984">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="UFRX" edc:nzwidth="0xA" edc:desc="Undersize Frames Received"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="OFR" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF" edc:_addr="0x42000988">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="OFRX" edc:nzwidth="0xA" edc:desc="Oversized Frames Received"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="JR" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF" edc:_addr="0x4200098C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="JRX" edc:nzwidth="0xA" edc:desc="Jabbers Received"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="FCSE" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF" edc:_addr="0x42000990">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="FCKR" edc:nzwidth="0xA" edc:desc="Frame Check Sequence Errors"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="LFFE" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF" edc:_addr="0x42000994">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="LFER" edc:nzwidth="0xA" edc:desc="Length Field Frame Errors"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="RSE" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF" edc:_addr="0x42000998">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RXSE" edc:nzwidth="0xA" edc:desc="Receive Symbol Errors"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="AE" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF" edc:_addr="0x4200099C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="AER" edc:nzwidth="0xA" edc:desc="Alignment Errors"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="RRE" edc:nzwidth="0x20" edc:access="--------------rrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFFF" edc:_addr="0x420009A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RXRER" edc:nzwidth="0x12" edc:desc="Receive Resource Errors"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="ROE" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF" edc:_addr="0x420009A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RXOVR" edc:nzwidth="0xA" edc:desc="Receive Overruns"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="IHCE" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x420009A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="HCKER" edc:nzwidth="0x8" edc:desc="IP Header Checksum Errors"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="TCE" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x420009AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="TCKER" edc:nzwidth="0x8" edc:desc="TCP Checksum Errors"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="UCE" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x420009B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="UCKER" edc:nzwidth="0x8" edc:desc="UDP Checksum Errors"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
