Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.1.122/edc/PIC32CX1025SG41128.PIC
      <edc:SFRDef ltx:memberofperipheral="CCL" edc:cname="LUTCTRL3" edc:nzwidth="0x20" edc:access="nnnnnnnn-nnnnnnnnnnnnnnnn-nn--n-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF7FFFB2" edc:_addr="0x42003814">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CCL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="LUT Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="LUT block is disabled" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="LUT block is enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FILTSEL" edc:nzwidth="0x2" edc:desc="Filter Selection">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Filter disabled" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SYNCH" edc:desc="Synchronizer enabled" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FILTER" edc:desc="Filter enabled" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EDGESEL" edc:nzwidth="0x1" edc:desc="Edge Selection">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Edge detector is disabled" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Edge detector is enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INSEL0" edc:nzwidth="0x4" edc:desc="Input Selection 0">
              <edc:SFRFieldSemantic edc:cname="MASK" edc:desc="Masked input" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FEEDBACK" edc:desc="Feedback input source" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="LINK" edc:desc="Linked LUT input source" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="EVENT" edc:desc="Event input source" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="IO" edc:desc="I/O pin input source" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="AC" edc:desc="AC input source" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="TC" edc:desc="TC input source" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="ALTTC" edc:desc="Alternate TC input source" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="TCC" edc:desc="TCC input source" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM" edc:desc="SERCOM input source" edc:when="(field &amp; 0xF) == 0x09"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INSEL1" edc:nzwidth="0x4" edc:desc="Input Selection 1">
              <edc:SFRFieldSemantic edc:cname="MASK" edc:desc="Masked input" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FEEDBACK" edc:desc="Feedback input source" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="LINK" edc:desc="Linked LUT input source" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="EVENT" edc:desc="Event input source" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="IO" edc:desc="I/O pin input source" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="AC" edc:desc="AC input source" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="TC" edc:desc="TC input source" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="ALTTC" edc:desc="Alternate TC input source" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="TCC" edc:desc="TCC input source" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM" edc:desc="SERCOM input source" edc:when="(field &amp; 0xF) == 0x09"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INSEL2" edc:nzwidth="0x4" edc:desc="Input Selection 2">
              <edc:SFRFieldSemantic edc:cname="MASK" edc:desc="Masked input" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FEEDBACK" edc:desc="Feedback input source" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="LINK" edc:desc="Linked LUT input source" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="EVENT" edc:desc="Event input source" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="IO" edc:desc="I/O pin input source" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="AC" edc:desc="AC input source" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="TC" edc:desc="TC input source" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="ALTTC" edc:desc="Alternate TC input source" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="TCC" edc:desc="TCC input source" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM" edc:desc="SERCOM input source" edc:when="(field &amp; 0xF) == 0x09"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INVEI" edc:nzwidth="0x1" edc:desc="Inverted Event Input Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Incoming event is not inverted" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Incoming event is inverted" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LUTEI" edc:nzwidth="0x1" edc:desc="LUT Event Input Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="LUT incoming event is disabled" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="LUT incoming event is enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LUTEO" edc:nzwidth="0x1" edc:desc="LUT Event Output Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="LUT event output is disabled" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="LUT event output is enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TRUTH" edc:nzwidth="0x8" edc:desc="Truth Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:regionid="HPB3" edc:beginaddr="0x43000000" edc:endaddr="0x43002CE8" edc:rw="rw">
      <edc:AdjustPoint edc:offset="0x1000" edc:_addr="0x43000000"/>
      <edc:SFRDef ltx:memberofperipheral="TCC4" edc:cname="CTRLA" edc:nzwidth="0x20" edc:access="--nnnnnnn-------nnnnnnnn-nn---nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F80FF63" edc:_addr="0x43001000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC4">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RESOLUTION" edc:nzwidth="0x2" edc:desc="Enhanced Resolution">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Dithering is disabled" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DITH4" edc:desc="Dithering is done every 16 PWM frames" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DITH5" edc:desc="Dithering is done every 32 PWM frames" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DITH6" edc:desc="Dithering is done every 64 PWM frames" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:nzwidth="0x3" edc:desc="Prescaler">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="No division" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide by 4" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide by 8" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide by 64" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Divide by 256" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="Divide by 1024" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="PRESCSYNC" edc:nzwidth="0x2" edc:desc="Prescaler and Counter Synchronization Selection">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="Reload or reset counter on next GCLK" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PRESC" edc:desc="Reload or reset counter on next prescaler clock" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="RESYNC" edc:desc="Reload or reset counter on next GCLK and reset prescaler counter" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ALOCK" edc:nzwidth="0x1" edc:desc="Auto Lock"/>
            <edc:SFRFieldDef edc:cname="MSYNC" edc:nzwidth="0x1" edc:desc="Master Synchronization (only for TCC Slave Instance)"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DMAOS" edc:nzwidth="0x1" edc:desc="DMA One-shot Trigger Mode"/>
            <edc:SFRFieldDef edc:cname="CPTEN0" edc:nzwidth="0x1" edc:desc="Capture Channel 0 Enable"/>
            <edc:SFRFieldDef edc:cname="CPTEN1" edc:nzwidth="0x1" edc:desc="Capture Channel 1 Enable"/>
            <edc:SFRFieldDef edc:cname="CPTEN2" edc:nzwidth="0x1" edc:desc="Capture Channel 2 Enable"/>
            <edc:SFRFieldDef edc:cname="CPTEN3" edc:nzwidth="0x1" edc:desc="Capture Channel 3 Enable"/>
            <edc:SFRFieldDef edc:cname="CPTEN4" edc:nzwidth="0x1" edc:desc="Capture Channel 4 Enable"/>
            <edc:SFRFieldDef edc:cname="CPTEN5" edc:nzwidth="0x1" edc:desc="Capture Channel 5 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC4" edc:cname="CTRLBCLR" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x43001004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC4">
            <edc:SFRFieldDef edc:cname="DIR" edc:nzwidth="0x1" edc:desc="Counter Direction"/>
            <edc:SFRFieldDef edc:cname="LUPD" edc:nzwidth="0x1" edc:desc="Lock Update"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:nzwidth="0x1" edc:desc="One-Shot"/>
            <edc:SFRFieldDef edc:cname="IDXCMD" edc:nzwidth="0x2" edc:desc="Ramp Index Command">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Command disabled: Index toggles between cycles A and B" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set index: cycle B will be forced in the next cycle" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="Clear index: cycle A will be forced in the next cycle" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="HOLD" edc:desc="Hold index: the next cycle will be the same as the current cycle" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x3" edc:desc="TCC Command">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Clear start, restart or retrigger" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Force stop" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Force update or double buffered registers" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="READSYNC" edc:desc="Force COUNT read synchronization" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DMAOS" edc:desc="One-shot DMA trigger" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC4" edc:cname="CTRLBSET" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x43001005">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC4">
            <edc:SFRFieldDef edc:cname="DIR" edc:nzwidth="0x1" edc:desc="Counter Direction"/>
            <edc:SFRFieldDef edc:cname="LUPD" edc:nzwidth="0x1" edc:desc="Lock Update"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:nzwidth="0x1" edc:desc="One-Shot"/>
            <edc:SFRFieldDef edc:cname="IDXCMD" edc:nzwidth="0x2" edc:desc="Ramp Index Command">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Command disabled: Index toggles between cycles A and B" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set index: cycle B will be forced in the next cycle" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="Clear index: cycle A will be forced in the next cycle" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="HOLD" edc:desc="Hold index: the next cycle will be the same as the current cycle" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x3" edc:desc="TCC Command">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Clear start, restart or retrigger" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Force stop" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Force update or double buffered registers" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="READSYNC" edc:desc="Force COUNT read synchronization" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DMAOS" edc:desc="One-shot DMA trigger" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x43001006"/>
      <edc:SFRDef ltx:memberofperipheral="TCC4" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="------------------rrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFF" edc:_addr="0x43001008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC4">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Swrst Busy"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable Busy"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:nzwidth="0x1" edc:desc="Ctrlb Busy"/>
            <edc:SFRFieldDef edc:cname="STATUS" edc:nzwidth="0x1" edc:desc="Status Busy"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x1" edc:desc="Count Busy"/>
            <edc:SFRFieldDef edc:cname="PATT" edc:nzwidth="0x1" edc:desc="Pattern Busy"/>
            <edc:SFRFieldDef edc:cname="WAVE" edc:nzwidth="0x1" edc:desc="Wave Busy"/>
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x1" edc:desc="Period Busy"/>
            <edc:SFRFieldDef edc:cname="CC0" edc:nzwidth="0x1" edc:desc="Compare Channel 0 Busy"/>
            <edc:SFRFieldDef edc:cname="CC1" edc:nzwidth="0x1" edc:desc="Compare Channel 1 Busy"/>
            <edc:SFRFieldDef edc:cname="CC2" edc:nzwidth="0x1" edc:desc="Compare Channel 2 Busy"/>
            <edc:SFRFieldDef edc:cname="CC3" edc:nzwidth="0x1" edc:desc="Compare Channel 3 Busy"/>
            <edc:SFRFieldDef edc:cname="CC4" edc:nzwidth="0x1" edc:desc="Compare Channel 4 Busy"/>
            <edc:SFRFieldDef edc:cname="CC5" edc:nzwidth="0x1" edc:desc="Compare Channel 5 Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
