Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.1.122/edc/PIC32CX1025SG41128.PIC
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PSR" edc:nzwidth="0x20" edc:access="-------rrrrrrrrr----rrrr----rrrr" edc:por="00000000111110000000000000000000" edc:mclr="00000000111110000000000000000000" edc:impl="0x1FF0F0F" edc:_addr="0x46000024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDINHC" edc:nzwidth="0x1" edc:desc="Command Inhibit (CMD)">
              <edc:SFRFieldSemantic edc:cname="CAN" edc:desc="Can issue command using only CMD line" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CANNOT" edc:desc="Cannot issue command" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDINHD" edc:nzwidth="0x1" edc:desc="Command Inhibit (DAT)">
              <edc:SFRFieldSemantic edc:cname="CAN" edc:desc="Can issue command which uses the DAT line" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CANNOT" edc:desc="Cannot issue command which uses the DAT line" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DLACT" edc:nzwidth="0x1" edc:desc="DAT Line Active">
              <edc:SFRFieldSemantic edc:cname="INACTIVE" edc:desc="DAT Line Inactive" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ACTIVE" edc:desc="DAT Line Active" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RTREQ" edc:nzwidth="0x1" edc:desc="Re-Tuning Request">
              <edc:SFRFieldSemantic edc:cname="OK" edc:desc="Fixed or well-tuned sampling clock" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="REQUIRED" edc:desc="Sampling clock needs re-tuning" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="WTACT" edc:nzwidth="0x1" edc:desc="Write Transfer Active">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No valid data" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Transferring data" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RTACT" edc:nzwidth="0x1" edc:desc="Read Transfer Active">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No valid data" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Transferring data" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BUFWREN" edc:nzwidth="0x1" edc:desc="Buffer Write Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Write disable" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Write enable" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BUFRDEN" edc:nzwidth="0x1" edc:desc="Buffer Read Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Read disable" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Read enable" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CARDINS" edc:nzwidth="0x1" edc:desc="Card Inserted">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Reset or Debouncing or No Card" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Card inserted" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CARDSS" edc:nzwidth="0x1" edc:desc="Card State Stable">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Reset or Debouncing" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="No Card or Insered" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CARDDPL" edc:nzwidth="0x1" edc:desc="Card Detect Pin Level">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No card present (SDCD#=1)" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Card present (SDCD#=0)" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WRPPL" edc:nzwidth="0x1" edc:desc="Write Protect Pin Level">
              <edc:SFRFieldSemantic edc:cname="PROTECTED" edc:desc="Write protected (SDWP#=0)" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Write enabled (SDWP#=1)" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATLL" edc:nzwidth="0x4" edc:desc="DAT[3:0] Line Level"/>
            <edc:SFRFieldDef edc:cname="CMDLL" edc:nzwidth="0x1" edc:desc="CMD Line Level"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="HC1R" edc:nzwidth="0x8" edc:access="nn-nnnnn" edc:por="111000000000" edc:mclr="111000000000" edc:impl="0xDF" edc:_addr="0x46000028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="LEDCTRL" edc:nzwidth="0x1" edc:desc="LED Control">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="LED off" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="LED on" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DW" edc:nzwidth="0x1" edc:desc="Data Width">
              <edc:SFRFieldSemantic edc:cname="1BIT" edc:desc="1-bit mode" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="4BIT" edc:desc="4-bit mode" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="HSEN" edc:nzwidth="0x1" edc:desc="High Speed Enable">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal Speed mode" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High Speed mode" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMASEL" edc:nzwidth="0x2" edc:desc="DMA Select">
              <edc:SFRFieldSemantic edc:cname="SDMA" edc:desc="SDMA is selected" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="32BIT" edc:desc="32-bit Address ADMA2 is selected" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CARDDTL" edc:nzwidth="0x1" edc:desc="Card Detect Test Level">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Card" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Card Inserted" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CARDDSEL" edc:nzwidth="0x1" edc:desc="Card Detect Signal Selection">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="SDCD# is selected (for normal use)" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TEST" edc:desc="The Card Select Test Level is selected (for test purpose)" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PCR" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00001110" edc:mclr="00001110" edc:impl="0xF" edc:_addr="0x46000029">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDBPWR" edc:nzwidth="0x1" edc:desc="SD Bus Power">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Power off" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Power on" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SDBVSEL" edc:nzwidth="0x3" edc:desc="SD Bus Voltage Select">
              <edc:SFRFieldSemantic edc:cname="1V8" edc:desc="1.8V (Typ.)" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="3V0" edc:desc="3.0V (Typ.)" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="3V3" edc:desc="3.3V (Typ.)" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
