Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.1.122/edc/PIC32CX1025SG41128.PIC
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="DEVTYPE" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0xE0040FCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPIU">
            <edc:SFRFieldDef edc:cname="SubType" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MajorType" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x30" edc:_addr="0xE0040FD0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CR" edc:nzwidth="0x20" edc:access="---n------n---nn--n-nnnnnnnn---n" edc:por="00000000000000000000010000010001" edc:mclr="00000000000000000000010000010001" edc:impl="0x10232FF1" edc:_addr="0xE0041000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ETM">
            <edc:SFRFieldDef edc:cname="ETMPD" edc:nzwidth="0x1" edc:desc="ETM Power Down"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PORTSIZE" edc:nzwidth="0x3" edc:desc="Port Size bits 2:0"/>
            <edc:SFRFieldDef edc:cname="STALL" edc:nzwidth="0x1" edc:desc="Stall Processor"/>
            <edc:SFRFieldDef edc:cname="BROUT" edc:nzwidth="0x1" edc:desc="Branch Output"/>
            <edc:SFRFieldDef edc:cname="DBGRQ" edc:nzwidth="0x1" edc:desc="Debug Request Control"/>
            <edc:SFRFieldDef edc:cname="PROG" edc:nzwidth="0x1" edc:desc="ETM Programming"/>
            <edc:SFRFieldDef edc:cname="PORTSEL" edc:nzwidth="0x1" edc:desc="ETM Port Select"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PORTMODE2" edc:nzwidth="0x1" edc:desc="Port Mode bit 2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PORTMODE" edc:nzwidth="0x2" edc:desc="Port Mode bits 1:0"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PORTSIZE3" edc:nzwidth="0x1" edc:desc="Port Size bit 3"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TSEN" edc:nzwidth="0x1" edc:desc="TimeStamp Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CCR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="10001100100000000010000000000000" edc:mclr="10001100100000000010000000000000" edc:_addr="0xE0041004"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TRIGGER" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041008"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE004100C"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="SR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041010"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="SCR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000100000110100001001" edc:mclr="00000000000000100000110100001001" edc:_addr="0xE0041014"/>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0xE0041018"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TEEVR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041020"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TECR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041024"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="FFLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041028"/>
      <edc:AdjustPoint edc:offset="0x114" edc:_addr="0xE004102C"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CNTRLDVR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041140"/>
      <edc:AdjustPoint edc:offset="0x9C" edc:_addr="0xE0041144"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="SYNCFR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000010000000000" edc:mclr="00000000000000000000010000000000" edc:_addr="0xE00411E0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="IDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="01000001000101001111001001010000" edc:mclr="01000001000101001111001001010000" edc:_addr="0xE00411E4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CCER" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00011000010101000001100000000000" edc:mclr="00011000010101000001100000000000" edc:_addr="0xE00411E8"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE00411EC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TESSEICR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE00411F0"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE00411F4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TSEVT" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE00411F8"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE00411FC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TRACEIDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041200"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0041204"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="IDR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041208"/>
      <edc:AdjustPoint edc:offset="0x108" edc:_addr="0xE004120C"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PDSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000001" edc:mclr="00000000000000000000000000000001" edc:_addr="0xE0041314"/>
      <edc:AdjustPoint edc:offset="0xBC8" edc:_addr="0xE0041318"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="ITMISCIN" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE0041EE0"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0041EE4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="ITTRIGOUT" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0xE0041EE8"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0041EEC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="ITATBCTR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE0041EF0"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0041EF4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="ITATBCTR0" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0xE0041EF8"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0041EFC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="ITCTRL" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0xE0041F00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ETM">
            <edc:SFRFieldDef edc:cname="INTEGRATION" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x9C" edc:_addr="0xE0041F04"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CLAIMSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041FA0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CLAIMCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041FA4"/>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0xE0041FA8"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="LAR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0xE0041FB0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="LSR" edc:nzwidth="0x20" edc:access="-----------------------------rrr" edc:impl="0x7" edc:_addr="0xE0041FB4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ETM">
            <edc:SFRFieldDef edc:cname="Present" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Access" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ByteAcc" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="AUTHSTATUS" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE0041FB8"/>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0xE0041FBC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="DEVTYPE" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000010011" edc:mclr="00000000000000000000000000010011" edc:_addr="0xE0041FCC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR4" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000100" edc:mclr="00000000000000000000000000000100" edc:_addr="0xE0041FD0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR5" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041FD4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR6" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041FD8"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR7" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041FDC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000100101" edc:mclr="00000000000000000000000000100101" edc:_addr="0xE0041FE0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000010111001" edc:mclr="00000000000000000000000010111001" edc:_addr="0xE0041FE4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000001011" edc:mclr="00000000000000000000000000001011" edc:_addr="0xE0041FE8"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041FEC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CIDR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000001101" edc:mclr="00000000000000000000000000001101" edc:_addr="0xE0041FF0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CIDR1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000010010000" edc:mclr="00000000000000000000000010010000" edc:_addr="0xE0041FF4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CIDR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000101" edc:mclr="00000000000000000000000000000101" edc:_addr="0xE0041FF8"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CIDR3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000010110001" edc:mclr="00000000000000000000000010110001" edc:_addr="0xE0041FFC"/>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:regionid="SCS" edc:beginaddr="0xE000E000" edc:endaddr="0xE000F000" edc:rw="rw"/>
    <edc:DeviceIDSector edc:regionid="devid" edc:beginaddr="0x41002018" edc:endaddr="0x4100201C" edc:value="0x61870500" edc:mask="0xFFFFF0FF"/>
    <edc:RegisterMap edc:id="RTC/MODE0">
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="CTRLA" edc:nzwidth="0x10" edc:access="n-n-nnnnn---nnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xAF8F" edc:addr="0x40002400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x2" edc:desc="Operating Mode">
              <edc:SFRFieldSemantic edc:cname="COUNT32" edc:desc="Mode 0: 32-bit Counter" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="COUNT16" edc:desc="Mode 1: 16-bit Counter" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CLOCK" edc:desc="Mode 2: Clock/Calendar" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="MATCHCLR" edc:nzwidth="0x1" edc:desc="Clear on Match"/>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:nzwidth="0x4" edc:desc="Prescaler">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="CLK_RTC_CNT = GCLK_RTC/1" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="CLK_RTC_CNT = GCLK_RTC/1" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="CLK_RTC_CNT = GCLK_RTC/2" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="CLK_RTC_CNT = GCLK_RTC/4" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="CLK_RTC_CNT = GCLK_RTC/8" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="CLK_RTC_CNT = GCLK_RTC/16" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="CLK_RTC_CNT = GCLK_RTC/32" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="CLK_RTC_CNT = GCLK_RTC/64" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="CLK_RTC_CNT = GCLK_RTC/128" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="CLK_RTC_CNT = GCLK_RTC/256" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="DIV512" edc:desc="CLK_RTC_CNT = GCLK_RTC/512" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="CLK_RTC_CNT = GCLK_RTC/1024" edc:when="(field &amp; 0xF) == 0x0B"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BKTRST" edc:nzwidth="0x1" edc:desc="BKUP Registers Reset On Tamper Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTSYNC" edc:nzwidth="0x1" edc:desc="Count Read Synchronization Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
