Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.1.122/edc/PIC32CX1025SG41128.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PC18" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM6"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="QDI2" edc:ppsfunction="G" ltx:memberofperipheral="PDEC"/>
      <edc:VirtualPin edc:name="GRXCK" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC19" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM6"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="GTXER" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC20" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT4" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="SDCD" edc:ppsfunction="I" ltx:memberofperipheral="SDHC1"/>
      <edc:VirtualPin edc:name="GRXDV" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="IN9" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC21" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT5" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="SDWP" edc:ppsfunction="I" ltx:memberofperipheral="SDHC1"/>
      <edc:VirtualPin edc:name="GCOL" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="IN10" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC22" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="GMDC" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC23" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="GMDIO" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD20" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT10" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="SDCD" edc:ppsfunction="I" ltx:memberofperipheral="SDHC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD21" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT11" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="SDWP" edc:ppsfunction="I" ltx:memberofperipheral="SDHC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB16" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC6"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F" ltx:memberofperipheral="TCC3"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="SDCD" edc:ppsfunction="I" ltx:memberofperipheral="SDHC1"/>
      <edc:VirtualPin edc:name="SCK0" edc:ppsfunction="J" ltx:memberofperipheral="I2S"/>
      <edc:VirtualPin edc:name="IO2" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN11" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB17" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC6"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F" ltx:memberofperipheral="TCC3"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="SDWP" edc:ppsfunction="I" ltx:memberofperipheral="SDHC1"/>
      <edc:VirtualPin edc:name="MCK0" edc:ppsfunction="J" ltx:memberofperipheral="I2S"/>
      <edc:VirtualPin edc:name="IO3" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="OUT3" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB18" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM7"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="QDI0" edc:ppsfunction="G" ltx:memberofperipheral="PDEC"/>
      <edc:VirtualPin edc:name="SDDAT0" edc:ppsfunction="I" ltx:memberofperipheral="SDHC1"/>
      <edc:VirtualPin edc:name="IO4" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB19" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM7"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="QDI1" edc:ppsfunction="G" ltx:memberofperipheral="PDEC"/>
      <edc:VirtualPin edc:name="SDDAT1" edc:ppsfunction="I" ltx:memberofperipheral="SDHC1"/>
      <edc:VirtualPin edc:name="IO5" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB20" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT4" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM7"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="QDI2" edc:ppsfunction="G" ltx:memberofperipheral="PDEC"/>
      <edc:VirtualPin edc:name="SDDAT2" edc:ppsfunction="I" ltx:memberofperipheral="SDHC1"/>
      <edc:VirtualPin edc:name="IO6" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB21" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT5" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM7"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="SDDAT3" edc:ppsfunction="I" ltx:memberofperipheral="SDHC1"/>
      <edc:VirtualPin edc:name="IO7" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA20" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT4" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X14" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="Y14" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC7"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="SDCMD" edc:ppsfunction="I" ltx:memberofperipheral="SDHC1"/>
      <edc:VirtualPin edc:name="FS0" edc:ppsfunction="J" ltx:memberofperipheral="I2S"/>
      <edc:VirtualPin edc:name="DATA4" edc:ppsfunction="K" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="GMDC" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA21" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT5" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X15" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="Y15" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC7"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="SDCK" edc:ppsfunction="I" ltx:memberofperipheral="SDHC1"/>
      <edc:VirtualPin edc:name="SDO" edc:ppsfunction="J" ltx:memberofperipheral="I2S"/>
      <edc:VirtualPin edc:name="DATA5" edc:ppsfunction="K" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="GMDIO" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA22" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X16" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="Y16" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC4"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="TX" edc:ppsfunction="I" ltx:memberofperipheral="CAN0"/>
      <edc:VirtualPin edc:name="SDI" edc:ppsfunction="J" ltx:memberofperipheral="I2S"/>
      <edc:VirtualPin edc:name="DATA6" edc:ppsfunction="K" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="IN6" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA23" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X17" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="Y17" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC4"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="SOF_1KHZ" edc:ppsfunction="H" ltx:memberofperipheral="USB"/>
      <edc:VirtualPin edc:name="RX" edc:ppsfunction="I" ltx:memberofperipheral="CAN0"/>
      <edc:VirtualPin edc:name="FS1" edc:ppsfunction="J" ltx:memberofperipheral="I2S"/>
      <edc:VirtualPin edc:name="DATA7" edc:ppsfunction="K" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="IN7" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA24" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT8" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC5"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F" ltx:memberofperipheral="TCC2"/>
      <edc:VirtualPin edc:name="QDI0" edc:ppsfunction="G" ltx:memberofperipheral="PDEC"/>
      <edc:VirtualPin edc:name="DM" edc:ppsfunction="H" ltx:memberofperipheral="USB"/>
      <edc:VirtualPin edc:name="TX" edc:ppsfunction="I" ltx:memberofperipheral="CAN0"/>
      <edc:VirtualPin edc:name="IN8" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA25" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT9" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC5"/>
      <edc:VirtualPin edc:name="QDI1" edc:ppsfunction="G" ltx:memberofperipheral="PDEC"/>
      <edc:VirtualPin edc:name="DP" edc:ppsfunction="H" ltx:memberofperipheral="USB"/>
      <edc:VirtualPin edc:name="RX" edc:ppsfunction="I" ltx:memberofperipheral="CAN0"/>
      <edc:VirtualPin edc:name="OUT2" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB22" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC7"/>
      <edc:VirtualPin edc:name="QDI2" edc:ppsfunction="G" ltx:memberofperipheral="PDEC"/>
      <edc:VirtualPin edc:name="SOF_1KHZ" edc:ppsfunction="H" ltx:memberofperipheral="USB"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="XIN1" edc:ppsfunction="XIN1" ltx:memberofperipheral="OSCCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB23" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC7"/>
      <edc:VirtualPin edc:name="QDI0" edc:ppsfunction="G" ltx:memberofperipheral="PDEC"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="XOUT1" edc:ppsfunction="XOUT1" ltx:memberofperipheral="OSCCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB24" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT8" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="QDI1" edc:ppsfunction="G" ltx:memberofperipheral="PDEC"/>
      <edc:VirtualPin edc:name="CMP0" edc:ppsfunction="M" ltx:memberofperipheral="AC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB25" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT9" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="QDI2" edc:ppsfunction="G" ltx:memberofperipheral="PDEC"/>
      <edc:VirtualPin edc:name="CMP1" edc:ppsfunction="M" ltx:memberofperipheral="AC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB26" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT12" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB27" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT13" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB28" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="SCK1" edc:ppsfunction="J" ltx:memberofperipheral="I2S"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB29" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="MCK1" edc:ppsfunction="J" ltx:memberofperipheral="I2S"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC24" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT8" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="TRACED3" edc:ppsfunction="H" ltx:memberofperipheral="TPIU"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC25" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT9" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="TRACED2" edc:ppsfunction="H" ltx:memberofperipheral="TPIU"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC26" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT10" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="TRACED1" edc:ppsfunction="H" ltx:memberofperipheral="TPIU"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC27" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT11" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="TRACECLK" edc:ppsfunction="H" ltx:memberofperipheral="TPIU"/>
      <edc:VirtualPin edc:name="IN4" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
